Revit 2027 API
ScheduleField.GetStyle Method
 Gets the style of this field.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public TableCellStyle GetStyle()
Public Function GetStyle As TableCellStyle
public:
TableCellStyle^ GetStyle()
member GetStyle : unit -> TableCellStyle
Return Value
TableCellStyle
See Also
Reference
ScheduleField Class
Autodesk.Revit.DB Namespace